//variadic1.срр -- использование рекурсии для распаковки пакета параметров 
//#include "stdafx.h" --- Visual Studio --- precompiled headers
#include <iostream>
#include <string> 

//--------------------------------------------------------------------------------------------------
// Определение для 0 параметров — завершение вызова 
void show_list3() {}
//--------------------------------------------------------------------------------------------------
// Определение для 1 и более параметров 
template<typename T, typename... Args>
void show_list3(T value, Args... args)
{
	std::cout << value << ", ";
	show_list3(args...);
}
//--------------------------------------------------------------------------------------------------
int main()
{
	int n = 14;
	double x = 2.71828;
	std::string mr = "Mr. String objects!";
	show_list3(n, x);
	show_list3(x*x, '!', 7, mr);

	std::cin.get();
	std::cin.get();
	return 0;
}
//--------------------------------------------------------------------------------------------------
/*
14, 2.71828, 7.38905, !, 7, Mr. String objects!
*/