#ifndef STACK_CLASS_H_
#define STACK_CLASS_H_

//-------------------------------------------------------------------------------------------------
struct customer 
{
	char fullname[35];
	double payment;
};
//-------------------------------------------------------------------------------------------------
typedef customer Items;
//-------------------------------------------------------------------------------------------------
class Stack
{
private:
	enum { MAX = 10 }; 	// константа, специфичная для класса 
	Items items[MAX];  	// хранит элементы стека 
	int top; 			// индекс вершины стека 
public:
	Stack();
	bool isempty() const;
	bool isfull() const;
	
	// push () возвращает false, если стек полон, и true - в противном случае 
	bool push(const Items & item); // добавляет элемент в стек 	
	
	// pop () возвращает false, если стек пуст, и true - в противном случае 
	bool pop(Items & item); // выталкивает элемент с вершины стека 
};
//-------------------------------------------------------------------------------------------------
#endif // STACK_CLASS_H_