//arraynew.cpp -- использование операции new 
//#include "stdafx.h" --- Visual Studio --- precompiled headers
#include <iostream>

using namespace std;

//-------------------------------------------------------------------------------------------------
int main() 
{
	double* p3 = new double[3]; // пространство для З значений double 
	p3[0] = 0.2;				 // трактовать рЗ как имя массива 
	p3[1] = 0.5;
	p3[2] = 0.8;

	cout << "p3[1] is " << p3[1] << ".\n";			// вывод рЗ[1] 
	p3 = p3 + 1;									// увеличение указателя 
	cout << "Now p3[0] is " << p3[0] << " and ";	// вывод рЗ[0] 
	cout << "p3[1] is " << p3[1] << " .\n" ;		// вывод рЗ[1] 
	p3 = p3 - 1;									// возврат указателя в начало 
	delete[] p3;									// освобождение памяти 

	std::cin.get();
	std::cin.get();
	return 0;
}
//-------------------------------------------------------------------------------------------------
/*
рЗ[1] is 0.5.
Now p3[0] is 0.5 and p3[l] is 0.8.
*/