//choices.cpp -- вариации массивов 
//#include "stdafx.h" --- Visual Studio --- precompiled headers
#include <iostream>
#include <vector>   // STL C++98
#include <array>    // C++0x

//-------------------------------------------------------------------------------------------------
int main()
{
	using namespace std;
	// С, исходный C++ 
	double a1[4] = { 1.2, 2.4, 3.6, 4.8 };
	// C++98 STL
	vector<double> a2(4);  // создание объекта vector с четырьмя элементами 
						  
	// Простой способ инициализации в С98 отсутствует 
	a2[0] = 1.0 / 3.0;
	a2[1] = 1.0 / 5.0;
	a2[2] = 1.0 / 7.0;
	a2[3] = 1.0 / 9.0;

	// С++11 -- создание и инициализация объекта array 
	array<double, 4> a3 = { 3.14, 2.72, 1.62, 1.41 };
	array<double, 4> a4;
	a4 = a3;     // допускается для объектов array одного и того же размера 

	// Использование нотации массивов 
	cout << "a1[2]: " << a1[2] << " at " << &a1[2] << endl;
	cout << "a2[2]: " << a2[2] << " at " << &a2[2] << endl;
	cout << "a3[2]: " << a3[2] << " at " << &a3[2] << endl;
	cout << "a4[2]: " << a4[2] << " at " << &a4[2] << endl;
	
	// Преднамеренная ошибка
	a1[-2] = 20.2;
	cout << "a1[-2]: " << a1[-2] << " at " << &a1[-2] << endl;
	cout << "a3[2]: " << a3[2] << " at " << &a3[2] << endl;
	cout << "a4[2]: " << a4[2] << " at " << &a4[2] << endl;
	
	std::cin.get();
	std::cin.get();
	return 0;
}
//-------------------------------------------------------------------------------------------------
/*
a1[2]: 3.6 at 0059FC04
a2[2]: 0.142857 at 00AB0578
a3[2]: 1.62 at 0059FBC4
a4[2]: 1.62 at 0059FB9C
a1[-2]: 20.2 at 0059FBE4
a3[2]: 1.62 at 0059FBC4
a4[2]: 1.62 at 0059FB9C
*/