// twofile1.срр -- переменные с внешним и внутренним связыванием 
//Компилировать c twofile2.cpp
//#include "stdafx.h" --- Visual Studio --- precompiled headers
#include <iostream>

int tom = 3;   // определение внешней переменной 
int dick = 30; // определение внешней переменной 
static int harry = 300; // статическая, внутреннее связывание 
//-------------------------------------------------------------------------------------------------
// Прототип функции 
void remote_access();
//-------------------------------------------------------------------------------------------------
int main() // использует глобальную переменную 
{
	using namespace std;
	cout << "main () reports the following addresses:\n"; // вывод адресов 
	cout << &tom << " = &tom, " << &dick << " = &dick, ";
	cout << &harry << " = &harry\n";
	remote_access();

	std::cin.get();
	std::cin.get();
	return 0;
}
//-------------------------------------------------------------------------------------------------