// stonewt.h — определение класса Stonewt 
#ifndef STONEWT_H_ 
#define STONEWT_H_

//-------------------------------------------------------------------------------------------------
class Stonewt
{
private:
	enum { Lbs_per_stn = 14 };		// фунтов на стоун 
	int stone;						// полных стоунов 
	double pds_left;				// дробное число фунтов 
	double pounds;					// общий вес в фунтах 
public:
	Stonewt(double lbs);			// конструктор для значения в фунтах 
	Stonewt(int stn, double lbs);	// конструктор для значения в стоунах и фунтах 
	Stonewt();					    // конструктор по умолчанию 
	~Stonewt();
	void show_lbs() const;			// отображение веса в формате фунтов 
	void show_stn() const;			// отображение веса в формате стоунов 
};
//-------------------------------------------------------------------------------------------------
#endif // STONEWT_H_