// inline.cpp -- использование встроенной функции 
//#include "stdafx.h" --- Visual Studio --- precompiled headers
#include <iostream>

using namespace std;

//-------------------------------------------------------------------------------------------------
// Определение встроенной функции 
inline double square(double x) { return x * x; }
//-------------------------------------------------------------------------------------------------
int main()
{
	double a, b;
	double c = 13.0;
	a = square(5.0);
	b = square(4.5 + 7.5); // допускается передача выражений 
	cout << "a = " << a << ", b = " << b << "\n";
	cout << "c = " << c;
	cout << ", с squared = " << square(c++) << "\n";
	cout << "Now с = " << c << "\n";

	std::cin.get();
	std::cin.get();
	return 0;
}
//-------------------------------------------------------------------------------------------------
/*
a = 25, b = 144
c = 13, с squared = 169
Now с = 14
*/