//arrfunl.срр -- функция с аргументом-массивом 
//#include "stdafx.h" --- Visual Studio --- precompiled headers
#include <iostream>

using namespace std;

const int ArSize = 8;
//------------------------------------------------------------------------------------------------
int sum_arr(int arr[], int n); // прототип 
//------------------------------------------------------------------------------------------------
int main() 
{
	int cookies[ArSize] = { 1,2,4,8,16,32,64,128 };
	// Некоторые системы требуют предварить int словом static, 
	// чтобы разрешить инициализацию массива 
	int sum = sum_arr(cookies, ArSize);
	cout << "Total cookies eaten: " << sum << "\n"; // вывод количества съеденного печенья 

	std::cin.get();
	std::cin.get();
	return 0;
}
//------------------------------------------------------------------------------------------------
// Возвращает сумму элементов массива целых чисел 
int sum_arr(int arr[], int n)
{
	int total = 0;
	for (int i = 0; i < n; i++)
		total = total + arr[i];
	return total;
}
//------------------------------------------------------------------------------------------------
/*
Total cookies eaten: 255
*/